In [9]:
#add two new modules
from sqlalchemy import create_engine
import pymysql
import pandas as pd

In [10]:
#create a connection
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

#connect to the MySQL instance
db_connection = create_engine(db_connection_str)

#cQuery the Credit One data
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [12]:
#view a quick sample the dataframe
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [13]:
# understand the makeup of the data
df.describe()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
count,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204,...,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204
unique,30002,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,159,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

In [14]:
#check the data types
df.info

<bound method DataFrame.info of       MyUnknownColumn         X1      X2           X3        X4   X5     X6  \
0                  ID  LIMIT_BAL     SEX    EDUCATION  MARRIAGE  AGE  PAY_0
1                   1      20000  female   university         1   24      2
2                   2     120000  female   university         2   26     -1
3                   3      90000  female   university         2   34      0
4                   4      50000  female   university         1   37      0
...               ...        ...     ...          ...       ...  ...    ...
30199           29996     220000    male  high school         1   39      0
30200           29997     150000    male  high school         2   43     -1
30201           29998      30000    male   university         2   37      4
30202           29999      80000    male  high school         1   41      1
30203           30000      50000    male   university         1   46      0

          X7     X8     X9  ...        X15        X16        X17       X18  \
0      PAY_2  PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1
1          2     -1     -1  ...          0          0          0         0
2          2      0      0  ...       3272       3455       3261         0
3          0      0      0  ...      14331      14948      15549      1518
4          0      0      0  ...      28314      28959      29547      2000
...      ...    ...    ...  ...        ...        ...        ...       ...
30199      0      0      0  ...      88004      31237      15980      8500
30200     -1     -1     -1  ...       8979       5190          0      1837
30201      3      2     -1  ...      20878      20582      19357         0
30202     -1      0      0  ...      52774      11855      48944     85900
30203      0      0      0  ...      36535      32428      15313      2078

            X19       X20       X21       X22       X23  \
0      PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
1           689         0         0         0         0
2          1000      1000      1000         0      2000
3          1500      1000      1000      1000      5000
4          2019      1200      1100      1069      1000
...         ...       ...       ...       ...       ...
30199     20000      5003      3047      5000      1000
30200      3526      8998       129         0         0
30201         0     22000      4200      2000      3100
30202      3409      1178      1926     52964      1804
30203      1800      1430      1000      1000      1000

                                Y
0      default payment next month
1                         default
2                         default
3                     not default
4                     not default
...                           ...
30199                 not default
30200                 not default
30201                     default
30202                     default
30203                     default

[30204 rows x 25 columns]>

In [15]:
#checking for duplicates
df = df.drop_duplicates()

In [17]:
#checking for missing values
print(df.isnull().sum())

MyUnknownColumn    0
X1                 0
X2                 0
X3                 0
X4                 0
X5                 0
X6                 0
X7                 0
X8                 0
X9                 0
X10                0
X11                0
X12                0
X13                0
X14                0
X15                0
X16                0
X17                0
X18                0
X19                0
X20                0
X21                0
X22                0
X23                0
Y                  0
dtype: int64

In [18]:
#check that data types are numeric
df.dtypes

MyUnknownColumn    object
X1                 object
X2                 object
X3                 object
X4                 object
X5                 object
X6                 object
X7                 object
X8                 object
X9                 object
X10                object
X11                object
X12                object
X13                object
X14                object
X15                object
X16                object
X17                object
X18                object
X19                object
X20                object
X21                object
X22                object
X23                object
Y                  object
dtype: object